Revit 2024 API
LoadComponent.Factor Property
 Load component factor.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double Factor { get; set; }
Visual Basic
Public Property Factor As Double
	Get
	Set
Visual C++
public:
property double Factor {
	double get ();
	void set (double value);
}
See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace